{
    "name": "Alexander J. Buckles",
    "about": "Autism Advocate: We're enabling individuals on the autism spectrum to live their best-possible lives.\n\n- Father of three awesome children, with more to come (God willing).\n- United States Marine \n- 5X founder\n- 3X Top-Performing Enterprise Sales Rep\n- 1X Sales VP with successful exit\n- Field Co-Selling Expert\n- 1 major startup failure (countless minor ones) -- if you're not failing, you're not trying hard enough 💪\n- Deeply passionate about sales process -- I take it very seriously -- If I challenge you on yours, don't be offended. I'm either trying to make you better or learn from you, so please always view my commentary through that lens.",
    "experiences": [
        {
            "institution_name": "Pathways for Autism",
            "linkedin_url": "https://www.linkedin.com/company/71718569/",
            "website": null,
            "industry": null,
            "type": null,
            "headquarters": null,
            "company_size": null,
            "founded": null,
            "from_date": "Oct 2021",
            "to_date": "Present",
            "description": "Activating the autistic workforce, building worldwide community, and empowering autism-focused innovations\nActivating the autistic workforce, building worldwide community, and empowering autism-focused innovations",
            "position_title": "CEO & Co-Founder",
            "duration": "3 yrs 6 mos",
            "location": "Orlando, Florida, United States"
        },
        {
            "institution_name": "Forecastable",
            "linkedin_url": "https://www.linkedin.com/company/10885965/",
            "website": null,
            "industry": null,
            "type": null,
            "headquarters": null,
            "company_size": null,
            "founded": null,
            "from_date": "",
            "to_date": "",
            "description": "CEO\nCEO\nFull-time\nFull-time\nSep 2024 - Present · 7 mos\nSep 2024 to Present · 7 mos\nForecastable produces partner-sourced pipeline, as a service, without adding headcount. Pilots and month-to-month contracts available. Contractually-guaranteed pipeline in 60-90 days.\nForecastable produces partner-sourced pipeline, as a service, without adding headcount. Pilots and month-to-month contracts available. Contractually-guaranteed pipeline in 60-90 days.\nHead of Product, Partnerships, and Value Engineering\nHead of Product, Partnerships, and Value Engineering\nDec 2023 - Sep 2024 · 10 mos\nDec 2023 to Sep 2024 · 10 mos\nHired an interim CEO (6x SaaS CRO, up market and down) to help raise capital, shape our GTM, and to be the voice of the customer for us as a seasoned CRO. \n\nDuring this period, we raised capital, secured customer case studies, activated an ecosystem of certified advisors on our methodology and as delivery partners, plus led the project for the re-platforming of our core internal technology to support our pivot into a fully-managed services offering, before taking the reins again as CEO.\nHired an interim CEO (6x SaaS CRO, up market and down) to help raise capital, shape our GTM, and to be the voice of the customer for us as a seasoned CRO. During this period, we raised capital, secured customer case studies, activated an ecosystem of certified advisors on our methodology and as delivery partners, plus led the project for the re-platforming of our core internal technology to support our pivot into a fully-managed services offering, before taking the reins again as CEO.\nCo-Founder & CEO\nCo-Founder & CEO\nJan 2018 - Dec 2023 · 6 yrs\nJan 2018 to Dec 2023 · 6 yrs\nOrlando, Florida Area\nOrlando, Florida Area\nFounded Forecastable to first solve for internal co-selling, providing B2B mid-market and enterprise deal teams the ability to effectively collaborate on account-development and open sales cycles via our online workspaces, while enforcing sales best practices.\n\nWhen partnerships started taking the market by storm, we pivoted our technology in that direction and subsequently pivoted to a technology-enablement managed service.\nFounded Forecastable to first solve for internal co-selling, providing B2B mid-market and enterprise deal teams the ability to effectively collaborate on account-development and open sales cycles via our online workspaces, while enforcing sales best practices. When partnerships started taking the market by storm, we pivoted our technology in that direction and subsequently pivoted to a technology-enablement managed service.",
            "position_title": "",
            "duration": null,
            "location": ""
        },
        {
            "institution_name": "PartnerSourced",
            "linkedin_url": "https://www.linkedin.com/company/98499932/",
            "website": null,
            "industry": null,
            "type": null,
            "headquarters": null,
            "company_size": null,
            "founded": null,
            "from_date": "Mar 2023",
            "to_date": "Present",
            "description": "Network, contribute, learn, and drive revenue with other partners operating in the same ecosystems.\nNetwork, contribute, learn, and drive revenue with other partners operating in the same ecosystems.",
            "position_title": "CEO",
            "duration": "2 yrs 1 mo",
            "location": "Orlando, Florida, United States"
        },
        {
            "institution_name": "StoriedUp",
            "linkedin_url": "https://www.linkedin.com/company/106017769/",
            "website": null,
            "industry": null,
            "type": null,
            "headquarters": null,
            "company_size": null,
            "founded": null,
            "from_date": "Jan 2024",
            "to_date": "Present",
            "description": "When you make your ecosystem story and alignment unmistakably deep, your:\n\n- Complete solution makes competitors look dangerously incomplete\n- Premium pricing becomes unquestionable\n- Revenue teams embrace partners as strategic assets instead of inconvenient add-ons\n- Market position strengthens with each intentional partner story “activated”\n- Board conversations shift from defensive tactics to offensive strategy\nWhen you make your ecosystem story and alignment unmistakably deep, your: - Complete solution makes competitors look dangerously incomplete - Premium pricing becomes unquestionable - Revenue teams embrace partners as strategic assets instead of inconvenient add-ons - Market position strengthens with each intentional partner story “activated” - Board conversations shift from defensive tactics to offensive strategy",
            "position_title": "CEO",
            "duration": "1 yr 3 mos",
            "location": "Orlando, Florida, United States"
        },
        {
            "institution_name": "RapidShots · Full-time",
            "linkedin_url": "https://www.linkedin.com/company/98494857/",
            "website": null,
            "industry": null,
            "type": null,
            "headquarters": null,
            "company_size": null,
            "founded": null,
            "from_date": "Mar 2023",
            "to_date": "Present",
            "description": "100% of profits dedicated to Pathways for Autism. #1 in employee gifts. LinkedIn-ready headshots in hours, using photos you already have on hand.\n100% of profits dedicated to Pathways for Autism. #1 in employee gifts. LinkedIn-ready headshots in hours, using photos you already have on hand.",
            "position_title": "CEO",
            "duration": "2 yrs 1 mo",
            "location": "Orlando, Florida, United States"
        },
        {
            "institution_name": "Commsor 🦕",
            "linkedin_url": "https://www.linkedin.com/company/14777627/",
            "website": null,
            "industry": null,
            "type": null,
            "headquarters": null,
            "company_size": null,
            "founded": null,
            "from_date": "Apr 2024",
            "to_date": "Present",
            "description": "The \"Go-To-Network\" Platform --> Every sales rep on the planet should leverage this technology to make more-meaningful use of their own professional network and the networks of their company's executives, board members, advisors, investors, and partners.\nThe \"Go-To-Network\" Platform --> Every sales rep on the planet should leverage this technology to make more-meaningful use of their own professional network and the networks of their company's executives, board members, advisors, investors, and partners.",
            "position_title": "Advisor",
            "duration": "1 yr",
            "location": "Orlando, Florida, United States"
        },
        {
            "institution_name": "Mentra · Contract",
            "linkedin_url": "https://www.linkedin.com/company/12648090/",
            "website": null,
            "industry": null,
            "type": null,
            "headquarters": null,
            "company_size": null,
            "founded": null,
            "from_date": "Mar 2023",
            "to_date": "Aug 2023",
            "description": "- Six-month engagement as interim CRO\n- Purpose of role was to advance autism in the enterprise workforce\n- Created leadership's quarterly/annual-planning framework and execution process\n- Made material changes to pricing, packaging, and positioning to support enterprise focus\n- Implemented contracting strategy that expedited procurement, shortened cycles, and increased TCV\n- Built core internal functions serving entire customer lifecycle (sales, customer success, partners, etc.)\n- Established partner-led growth mechanism (Goal: 100% Partner Attach)\n- Championed creation of enterprise marketplace\n- Designed and executed 40-person executive event, driving in-person engagement across industry leaders\n- Hired first sales rep, winning two F500 customers in first 60 days, navigating complex procurement\n- Crafted variable compensation plan for sales organization\n- Interfaced with various investors on an as-needed basis\n- Supported founders through daily \"founder-level things\" (technical term - if you've been in an early-stage startup, you know what I mean)\n- Six-month engagement as interim CRO - Purpose of role was to advance autism in the enterprise workforce - Created leadership's quarterly/annual-planning framework and execution process - Made material changes to pricing, packaging, and positioning to support enterprise focus - Implemented contracting strategy that expedited procurement, shortened cycles, and increased TCV - Built core internal functions serving entire customer lifecycle (sales, customer success, partners, etc.) - Established partner-led growth mechanism (Goal: 100% Partner Attach) - Championed creation of enterprise marketplace - Designed and executed 40-person executive event, driving in-person engagement across industry leaders - Hired first sales rep, winning two F500 customers in first 60 days, navigating complex procurement - Crafted variable compensation plan for sales organization - Interfaced with various investors on an as-needed basis - Supported founders through daily \"founder-level things\" (technical term - if you've been in an early-stage startup, you know what I mean)",
            "position_title": "CRO",
            "duration": "6 mos",
            "location": "Orlando, Florida, United States"
        },
        {
            "institution_name": "Perkuto",
            "linkedin_url": "https://www.linkedin.com/company/27237129/",
            "website": null,
            "industry": null,
            "type": null,
            "headquarters": null,
            "company_size": null,
            "founded": null,
            "from_date": "Jun 2019",
            "to_date": "May 2021",
            "description": "- Member of executive management team. Functionally held role of CRO. \n- Hired to double revenue, via enterprise motions (primarily partner co-selling), to attract acquisition. \n- Company successfully acquired\n- Member of executive management team. Functionally held role of CRO. - Hired to double revenue, via enterprise motions (primarily partner co-selling), to attract acquisition. - Company successfully acquired\nKeystone Capital Announces Acquisition of Perkuto by Portfolio Company MERGE\nKeystone Capital Announces Acquisition of Perkuto by Portfolio Company MERGE\nKeystone Capital Management, L.P. (“Keystone”) is pleased to announce that its portfolio company, MERGE, has acquired Perkuto, a leading provider of m\nKeystone Capital Management, L.P. (“Keystone”) is pleased to announce that its portfolio company, MERGE, has acquired Perkuto, a leading provider of m",
            "position_title": "Vice President, Sales",
            "duration": "2 yrs",
            "location": "Montreal, Quebec, Canada"
        },
        {
            "institution_name": "Adobe",
            "linkedin_url": "https://www.linkedin.com/company/1480/",
            "website": null,
            "industry": null,
            "type": null,
            "headquarters": null,
            "company_size": null,
            "founded": null,
            "from_date": "Jan 2017",
            "to_date": "Jun 2019",
            "description": "Consistent, global top-five sales performer for Enterprise Marketo business unit\nConsistent, global top-five sales performer for Enterprise Marketo business unit\nAdobe to acquire Marketo in $4.75 billion deal\nAdobe to acquire Marketo in $4.75 billion deal\nCNBC.com's Alex Sherman reports Adobe will acquire Marketo for $4.75 billion.\nCNBC.com's Alex Sherman reports Adobe will acquire Marketo for $4.75 billion.",
            "position_title": "Account Executive, Enterprise",
            "duration": "2 yrs 6 mos",
            "location": "Orlando, Florida Area"
        },
        {
            "institution_name": "Auritas",
            "linkedin_url": "https://www.linkedin.com/company/140888/",
            "website": null,
            "industry": null,
            "type": null,
            "headquarters": null,
            "company_size": null,
            "founded": null,
            "from_date": "",
            "to_date": "",
            "description": "Account Executive, Enterprise\nAccount Executive, Enterprise\nJan 2016 - Jan 2017 · 1 yr 1 mo\nJan 2016 to Jan 2017 · 1 yr 1 mo\nOrlando, Florida Area\nOrlando, Florida Area\n- Transitioned from Marketing to Enterprise Sales\n- Deployed highly-effective field co-selling program with SAP & Dell\n- Best performer in history of company, advising large enterprise organizations, running SAP, on crafting solutions around HANA, S/4HANA, BW/4HANA, Data Management, Enterprise Content Management, and Predictive Analytics.\n- Transitioned from Marketing to Enterprise Sales - Deployed highly-effective field co-selling program with SAP & Dell - Best performer in history of company, advising large enterprise organizations, running SAP, on crafting solutions around HANA, S/4HANA, BW/4HANA, Data Management, Enterprise Content Management, and Predictive Analytics.\nDell, SAP partner on new products to streamline cloud, big data, IoT deployments\nDell, SAP partner on new products to streamline cloud, big data, IoT deployments\nAt the 2016 SAP SAPPHIRE NOW, Dell and SAP announced a new architecture for IoT as well as new cloud and analytics tools to help companies deploy these new technologies faster.\nMarketing Manager\nMarketing Manager\nFull-time\nFull-time\nJul 2015 - Dec 2015 · 6 mos\nJul 2015 to Dec 2015 · 6 mos\nHired to establish marketing division, hire replacement, then transition to sales. Allowed me to learn the SAP ecosystem for a bit, without a quota hanging over my head.\n\n- Deployed Marketo and ran best-practice demand-gen campaigns.\n- Leveraged marketing capabilities to drive meaningful MDF for co-selling and co-marketing between Dell, SAP, and Auritas.\n- Architected and orchestrated road show with Dell & SAP, touring N. America and educating about SAP S/4HANA.\n- Managed various ASUG & SAP SAPPHIRE engagement/events\nHired to establish marketing division, hire replacement, then transition to sales. Allowed me to learn the SAP ecosystem for a bit, without a quota hanging over my head. - Deployed Marketo and ran best-practice demand-gen campaigns. - Leveraged marketing capabilities to drive meaningful MDF for co-selling and co-marketing between Dell, SAP, and Auritas. - Architected and orchestrated road show with Dell & SAP, touring N. America and educating about SAP S/4HANA. - Managed various ASUG & SAP SAPPHIRE engagement/events",
            "position_title": "",
            "duration": null,
            "location": ""
        },
        {
            "institution_name": "Demetree Global",
            "linkedin_url": "https://www.linkedin.com/company/2689530/",
            "website": null,
            "industry": null,
            "type": null,
            "headquarters": null,
            "company_size": null,
            "founded": null,
            "from_date": "2014 -",
            "to_date": "",
            "description": "Accountable for all marketing initiatives across seven subsidiaries. Verticals served: \n\n- Commercial Real Estate\n- Commercial Property Management\n- Environmental Consulting & Remediation\n- Fine-Dining Restaurant\n- Vacation Property Leasing & Management\n- Philanthropy\n- Student Housing & Multi-Family Housing.\n\nThis was my first exposure to implementing more-advanced email nurtures and tracking via HubSpot and other integrated technologies.\nAccountable for all marketing initiatives across seven subsidiaries. Verticals served: - Commercial Real Estate - Commercial Property Management - Environmental Consulting & Remediation - Fine-Dining Restaurant - Vacation Property Leasing & Management - Philanthropy - Student Housing & Multi-Family Housing. This was my first exposure to implementing more-advanced email nurtures and tracking via HubSpot and other integrated technologies.",
            "position_title": "Marketing Director",
            "duration": "1 yr",
            "location": "Orlando, Florida Area"
        },
        {
            "institution_name": "Tinubu Square",
            "linkedin_url": "https://www.linkedin.com/company/71432/",
            "website": null,
            "industry": null,
            "type": null,
            "headquarters": null,
            "company_size": null,
            "founded": null,
            "from_date": "",
            "to_date": "",
            "description": "VP, Business Development\nVP, Business Development\n2011 - 2013 · 2 yrs\n2011 to 2013 · 2 yrs\nOrlando, Florida Area\nOrlando, Florida Area\n- Formerly e-SURETY (acquired by Tinubu Square)\n- Held complete oversight over sales, marketing, customer support, and product development. \n- Leveraged in-house capabilities to build a technology-centric managing general agency (Suretegrity.com) that grew into all 50 states, primarily through organic search.\n- Personally-licensed agent nationwide\n- Both the agency & SaaS company were subsequently acquired.\n- Formerly e-SURETY (acquired by Tinubu Square) - Held complete oversight over sales, marketing, customer support, and product development. - Leveraged in-house capabilities to build a technology-centric managing general agency (Suretegrity.com) that grew into all 50 states, primarily through organic search. - Personally-licensed agent nationwide - Both the agency & SaaS company were subsequently acquired.\nTinubu® Square Announces Acquisition of U.S. Company eSURETY®\nTinubu® Square Announces Acquisition of U.S. Company eSURETY®\nTinubu Square acquires the US-based company eSURETY and offers a complete SaaS-based Enterprise Solution to the Credit Insurance and Surety industry.\nTinubu Square acquires the US-based company eSURETY and offers a complete SaaS-based Enterprise Solution to the Credit Insurance and Surety industry.\nBusiness Development Manager\nBusiness Development Manager\nFull-time\nFull-time\n2009 - 2011 · 2 yrs\n2009 to 2011 · 2 yrs\nSales Specialist\nSales Specialist\nFull-time\nFull-time\n2007 - 2009 · 2 yrs\n2007 to 2009 · 2 yrs\nOrlando, Florida, United States\nOrlando, Florida, United States",
            "position_title": "",
            "duration": null,
            "location": ""
        },
        {
            "institution_name": "Sprint · Full-time",
            "linkedin_url": "https://www.linkedin.com/company/1106/",
            "website": null,
            "industry": null,
            "type": null,
            "headquarters": null,
            "company_size": null,
            "founded": null,
            "from_date": "2006 -",
            "to_date": "",
            "description": "",
            "position_title": "Retail Sales Associate",
            "duration": "1 yr",
            "location": "Orlando, Florida, United States"
        },
        {
            "institution_name": "RadioShack · Full-time",
            "linkedin_url": "https://www.linkedin.com/search/results/all/?keywords=RadioShack",
            "website": null,
            "industry": null,
            "type": null,
            "headquarters": null,
            "company_size": null,
            "founded": null,
            "from_date": "2005 -",
            "to_date": "",
            "description": "",
            "position_title": "Retail Sales Associate",
            "duration": "1 yr",
            "location": "Orlando, Florida, United States"
        },
        {
            "institution_name": "United States Marine Corps",
            "linkedin_url": "https://www.linkedin.com/company/2039/",
            "website": null,
            "industry": null,
            "type": null,
            "headquarters": null,
            "company_size": null,
            "founded": null,
            "from_date": "2002 -",
            "to_date": "",
            "description": "Oorah!\nOorah!",
            "position_title": "Corporal",
            "duration": "3 yrs",
            "location": "Iwakuni, Yamaguchi, Japan"
        }
    ],
    "education": [
        {
            "institution_name": "The Citadel",
            "linkedin_url": "https://www.linkedin.com/company/21508/",
            "website": null,
            "industry": null,
            "type": null,
            "headquarters": null,
            "company_size": null,
            "founded": null,
            "from_date": null,
            "to_date": null,
            "description": "One of only two, 4-Year Army ROTC scholarship recipients - Left early on to enlist in The United Stated Marine Corps (oh the mind of a 17-year old!).\nOne of only two, 4-Year Army ROTC scholarship recipients - Left early on to enlist in The United Stated Marine Corps (oh the mind of a 17-year old!).",
            "degree": "2002 - 2002"
        },
        {
            "institution_name": "The Citadel",
            "linkedin_url": "https://www.linkedin.com/company/21508/",
            "website": null,
            "industry": null,
            "type": null,
            "headquarters": null,
            "company_size": null,
            "founded": null,
            "from_date": null,
            "to_date": null,
            "description": "One of only two, 4-Year Army ROTC scholarship recipients - Left early on to enlist in The United Stated Marine Corps (oh the mind of a 17-year old!).\nOne of only two, 4-Year Army ROTC scholarship recipients - Left early on to enlist in The United Stated Marine Corps (oh the mind of a 17-year old!).",
            "degree": "2002 - 2002"
        }
    ],
    "company": "Pathways for Autism",
    "job_title": "CEO & Co-Founder",
    "interests": [],
    "accomplishments": []
}